posts/attempt-to-test-rss-feeds.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Attempt to test RSS feeds</title>
<meta name="generator" content="Org Mode" />
<!-- <link rel="stylesheet" type="text/css" href="/ox.css"/> -->
<link rel="stylesheet" type="text/css" href="/custom.css"/>
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=JetBrains+Mono" rel="stylesheet">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css">
<!-- copy org-blocks to clipboard  -->
</head>
<body>
<div id="preamble" class="status">
<hr style="border-top: 1px solid black;">
<div class='topnav' style='display: flex; justify-content: space-between; align-items: center;'>
  <h2 style='margin-top: 0; margin-bottom: 0; margin-left:0px;'>Javier Pacheco</h2> 
  <div>
    <a href='/index.html' style='font-weight:bold;'>Home</a> |
    <a href='/archive.html' style='font-weight:bold;'>Blog</a> | 
    <a href='/about.html' style='font-weight:bold;'>About Me</a> | 
  </div>
</div>
<hr style="border-top: 1px solid black;">
</div>
<div id="content" class="content">
<header>
<h1 class="title">Attempt to test RSS feeds</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc071be4">Rss Feeds.</a></li>
<li><a href="#org2e747d6">Packages needed:</a></li>
<li><a href="#org5c9e56e">Functions to use:</a></li>
<li><a href="#org94fbef3">Testing.</a></li>
</ul>
</div>
</nav>
<p>

</p>
<div class="PREVIEW" id="orgaf981a1">
<p>
Hello.
</p>

<p>
This post, is about  more like a testing, because, I'm trying to add RSS feeds into 
this "web-page", so basically this is a test, and see if when I build the webpage
is going to work&#x2026; or not.
So, this is the preview and read this post to see what I'm trying to do.
</p>

</div>

<div id="outline-container-orgc071be4" class="outline-2">
<h2 id="orgc071be4">Rss Feeds.</h2>
<div class="outline-text-2" id="text-orgc071be4">
<p>
First, what is <code>rss feeds</code>?
This is what wikipedia have in their page:
</p>
<pre class="example" id="org3508264">
RSS (RDF Site Summary or Really Simple Syndication) is a web feed that allows users and applications to access updates to websites in a standardized, computer-readable format. Subscribing to RSS feeds can allow a user to keep track of many different websites in a single news aggregator, which constantly monitor sites for new content, removing the need for the user to manually check them. News aggregators (or "RSS readers") can be built into a browser, installed on a desktop computer, or installed on a mobile device.
</pre>

<p>
Well whit that read, what I'm going to do is to export a file with the <code>.xml</code> extension,
and stored in my host <code>codeberg pages</code>, well that is the goal, but I'm not sure about it.
</p>
</div>
</div>

<div id="outline-container-org2e747d6" class="outline-2">
<h2 id="org2e747d6">Packages needed:</h2>
<div class="outline-text-2" id="text-org2e747d6">
<p>
These are the packages that we need to use to make the rss file:
</p>
<ul class="org-ul">
<li>ox-publish.</li>
<li>ox-rss.</li>
<li>webfeeder.</li>
<li>esxml.</li>
</ul>

<p>
and these need to be in the <code>build-site.el</code> script:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Check and install dependencies</span>
(<span class="org-keyword">dolist</span> (package '(htmlize ox-rss webfeeder esxml))
  (<span class="org-keyword">unless</span> (package-installed-p package)
    (package-install package)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Load publishing system</span>
(<span class="org-keyword">require</span> '<span class="org-constant">ox-publish</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">ox-rss</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">webfeeder</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">esxml</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org5c9e56e" class="outline-2">
<h2 id="org5c9e56e">Functions to use:</h2>
<div class="outline-text-2" id="text-org5c9e56e">
<p>
Now declare some functions to parse in the public folder that we create for save the
exported <code>html</code> files.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">build RSS feed</span>

(<span class="org-keyword">defun</span> <span class="org-function-name">dw/rss-extract-date</span> (html-file)
  <span class="org-doc">"Extract the post date from an HTML file."</span>
  (<span class="org-keyword">with-temp-buffer</span>
    (insert-file-contents html-file)
    (<span class="org-keyword">let*</span> ((dom (libxml-parse-html-region (point-min) (point-max)))
           (date-string (dom-text (car (dom-by-class dom <span class="org-string">"date"</span>))))
           (parsed-date (parse-time-string date-string))
           (day (nth 3 parsed-date))
           (month (nth 4 parsed-date))
           (year (nth 5 parsed-date)))
      <span class="org-comment-delimiter">;; </span><span class="org-comment">NOTE: Hardcoding this at 8am for now</span>
      (encode-time 0 0 8 day month year))))

(<span class="org-keyword">setq</span> webfeeder-date-function #'dw/rss-extract-date)

(webfeeder-build <span class="org-string">"rss.xml"</span>
                 <span class="org-string">"./public"</span>
                 <span class="org-string">"https://jpacheco.codeberg.page/"</span>
                 (mapcar (<span class="org-keyword">lambda</span> (file) (concat <span class="org-string">"posts/"</span> file))
                         (<span class="org-keyword">let</span> ((default-directory (expand-file-name <span class="org-string">"./public/posts/"</span>)))
                           (directory-files-recursively <span class="org-string">"./"</span> <span class="org-string">".*\\.html$"</span>)))
                 <span class="org-builtin">:builder</span> 'webfeeder-make-rss
                 <span class="org-builtin">:title</span> <span class="org-string">"Javier Pacheco's Blog"</span>
                 <span class="org-builtin">:description</span> <span class="org-string">"Posts, information and resources from Javier Pacheco"</span>
                 <span class="org-builtin">:author</span> <span class="org-string">"Javier Pacheco"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org94fbef3" class="outline-2">
<h2 id="org94fbef3">Testing.</h2>
<div class="outline-text-2" id="text-org94fbef3">
<p>
Well, this post ends here, now in a few minutes this post is going to be uploaded,
and I'll see if rss feeds generator actually works whit the functions and  commands
above.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-12-26 Tue 14:21</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
